YavuzSelimKiziltas/STM32F767xx-Drivers/Drivers/Inc/stm32f7xx_pav.h
/* Base Adress of Peripheral Bus AHBx and APBx (RM pg. 77 ) */
#define APB1_BASEADDR 0x40000000
#define APB2_BASEADDR 0x40010000
#define AHB1_BASEADDR 0x40020000
#define AHB2_BASEADDR 0x50000000
#define AHB3_BASEADDR 0xA0000000

/* Base Address of AHB1 Peripherals (RM pg. 78 ) */
#define GPIOA_BASEADDR AHB1_BASEADDR
#define GPIOB_BASEADDR (AHB1_BASEADDR + 0x0400)
#define GPIOC_BASEADDR (AHB1_BASEADDR + 0x0800)
#define GPIOD_BASEADDR (AHB1_BASEADDR + 0x0C00)
#define GPIOE_BASEADDR (AHB1_BASEADDR + 0x1000)
#define GPIOF_BASEADDR (AHB1_BASEADDR + 0x1400)
#define GPIOG_BASEADDR (AHB1_BASEADDR + 0x1800)
#define GPIOH_BASEADDR (AHB1_BASEADDR + 0x1C00)

#define CRC_BASEADDR   (AHB1_BASEADDR + 0x3000)
#define RCC_BASEADDR   (AHB1_BASEADDR + 0x3800)

#define DMA1_BASEADDR  (AHB1_BASEADDR + 0x6000)
#define DMA2_BASEADDR  (AHB1_BASEADDR + 0x6400)

#define ETH_BASEADDR  (AHB1_BASEADDR + 0x8000)

#define USB_OTG_HS_BASEADDR		(0x40040000)

/* Base Address of AHB2 Peripherals (RM pg. 77)*/
#define USB_OTG_FS_BASEADDR		(0x50000000)


/* Base Address of APB1 Peripheral Bus (RM pg. 80) */
#define TIM2_BASEADDR		(APB1_BASEADDR)
#define TIM3_BASEADDR		(APB1_BASEADDR + 0x0400)
#define TIM4_BASEADDR		(APB1_BASEADDR + 0x0800)
#define TIM5_BASEADDR		(APB1_BASEADDR + 0x0C00)
#define TIM6_BASEADDR		(APB1_BASEADDR + 0x1000)
#define TIM7_BASEADDR		(APB1_BASEADDR + 0x1400)
#define TIM12_BASEADDR		(APB1_BASEADDR + 0x1800)
#define TIM13_BASEADDR		(APB1_BASEADDR + 0x1C00)
#define TIM14_BASEADDR		(APB1_BASEADDR + 0x2000)

#define WWDG_BASEADDR		(APB1_BASEADDR + 0x2C00)
#define IWDG_BASEADDR		(APB1_BASEADDR + 0x3000)

#define CAN1_BASEADDR		(APB1_BASEADDR + 0x6400)
#define CAN2_BASEADDR		(APB1_BASEADDR + 0x6800)
#define CAN3_BASEADDR		(APB1_BASEADDR + 0x3400)

// They share the same base address
#define SPI2_BASEADDR		(APB1_BASEADDR + 0x3800)
#define SPI3_BASEADDR		(APB1_BASEADDR + 0x3C00)
#define I2S_2_BASEADDR		(APB1_BASEADDR + 0x3800)
#define I2S_3_BASEADDR		(APB1_BASEADDR + 0x3C00)

#define USART2_BASEADDR		(APB1_BASEADDR + 0x4400)
#define USART3_BASEADDR		(APB1_BASEADDR + 0x4800)
#define UART4_BASEADDR		(APB1_BASEADDR + 0x4C00)
#define UART5_BASEADDR		(APB1_BASEADDR + 0x5000)
#define UART7_BASEADDR		(APB1_BASEADDR + 0x7800)
#define UART8_BASEADDR		(APB1_BASEADDR + 0x7C00)

#define I2C_1_BASEADDR		(APB1_BASEADDR + 0x5400)
#define I2C_2_BASEADDR		(APB1_BASEADDR + 0x5800)
#define I2C_3_BASEADDR		(APB1_BASEADDR + 0x5C00)
#define I2C_4_BASEADDR		(APB1_BASEADDR + 0x6000)

#define DAC_BASEADDR		(APB1_BASEADDR + 0x7400)

/* Base Address of APB2 Peripheral Bus (RM pg. 79) */
#define TIM1_BASEADDR		APB2_BASEADDR
#define TIM8_BASEADDR		(APB2_BASEADDR + 0x0400)
#define TIM9_BASEADDR		(APB2_BASEADDR + 0x4000)
#define TIM10_BASEADDR		(APB2_BASEADDR + 0x4400)
#define TIM11_BASEADDR		(APB2_BASEADDR + 0x4800)

#define USART1_BASEADDR		(APB2_BASEADDR + 0x1000)
#define USART6_BASEADDR		(APB2_BASEADDR + 0x1400)

#define ADC_BASEADDR		(APB2_BASEADDR + 0x2000)

#define SPI1_BASEADDR		(APB2_BASEADDR + 0x3000)
#define SPI4_BASEADDR		(APB2_BASEADDR + 0x3400)
#define SPI5_BASEADDR		(APB2_BASEADDR + 0x5000)
#define SPI6_BASEADDR		(APB2_BASEADDR + 0x5400)

#define SYSCFG_BASEADDR		(APB2_BASEADDR + 0x3800)
#define EXTI_BASEADDR		(APB2_BASEADDR + 0x3C00)

#define SCS_BASEADDR        (0xE000E000UL)                            /*!< System Control Space Base Address */
#define NVIC_BASEADDR       (SCS_BASEADDR +  0x0100UL)                /*!< NVIC Base Address */
#define NVIC                ((NVIC_RegTypeDef *)NVIC_BASEADDR)   	  /*!< NVIC configuration struct */

/* GPIO Register Typedef (RM pg. 235) */
typedef struct
{
	__vo uint32_t MODER;		/**< Selects the I/O Mode (Input, Output, Alternate, Analog)
									 Address Offset = 0x00 */

	__vo uint32_t OTYPER;		/**< Selects the Output type (Push-pull, Open-drain)
									 Offset = 0x04 */

	__vo uint32_t OSPEEDR;		/**< Selects the Output Speed
									 Offset = 0x08 */

	__vo uint32_t PUPDR;		/**< Selects the Pull-up or Pull-down
									 Offset = 0x0C */

	__vo uint32_t IDR;			/**< Input Data Register (Read Only)
									 Offset = 0x10 */

	__vo uint32_t ODR;			/**< Output Data Register (Read/Write)
									 Offset = 0x14 */

	__vo uint32_t BSRR;			/**< GPIO port bit set/reset register
									 Offset = 0x18 */

	__vo uint32_t LCKR;			/**< GPIO port configuration lock register
									 Offset = 0x1C */

	__vo uint32_t AFR[2];		/**< GPIO alternate function registers
									 Offset = 0x20 - 0x28 */

}GPIO_RegTypeDef_t;


/* RCC Register Typedef (RM pg. 217) */
typedef struct
{
	__vo uint32_t CR;					/**< Offset = 0x00 */

	__vo uint32_t PLLCFGR;				/**< Offset = 0x04 */

	__vo uint32_t CFGR;					/**< Offset = 0x08 */

	__vo uint32_t CIR;					/**< Offset = 0x0C */

	__vo uint32_t AHB1RSTR;				/**< Offset = 0x10 */

	__vo uint32_t AHB2RSTR;				/**< Offset = 0x14 */

	__vo uint32_t AHB3RSTR;				/**< Offset = 0x18 */

	__vo uint32_t RESERVED_0;			/**< Offset = 0x1C - 0x20 */

	__vo uint32_t APB1RSTR;				/**< Offset = 0x20 */

	__vo uint32_t APB2RSTR;				/**< Offset = 0x24 */

	__vo uint32_t RESERVED_1[2];		/**< Offset = 0x28 - 0x30 */

	__vo uint32_t AHB1ENR;				/**< Offset = 0x30 */

	__vo uint32_t AHB2ENR;				/**< Offset = 0x34 */

	__vo uint32_t AHB3ENR;				/**< Offset = 0x38 */

	__vo uint32_t RESERVED_2;			/**< Offset = 0x3C - 0x40 */

	__vo uint32_t APB1ENR;				/**< Offset = 0x40 */

	__vo uint32_t APB2ENR;				/**< Offset = 0x44 */

	__vo uint32_t RESERVED_3[2];		/**< Offset = 0x48 - 0x50 */

	__vo uint32_t AHB1LPENR;			/**< Offset = 0x50 */

	__vo uint32_t AHB2LPENR;			/**< Offset = 0x54 */

	__vo uint32_t AHB3LPENR;			/**< Offset = 0x58 */

	__vo uint32_t RESERVED_4;			/**< Offset = 0x5C - 0x60 */

	__vo uint32_t APB1LPENR;			/**< Offset = 0x60 */

	__vo uint32_t APB2LPENR;			/**< Offset = 0x64 */

	__vo uint32_t RESERVED_5[2];		/**< Offset = 0x68 - 0x70 */

	__vo uint32_t BDCR;					/**< Offset = 0x70 */

	__vo uint32_t CSR;					/**< Offset = 0x74 */

	__vo uint32_t RESERVED_6[2];		/**< Offset = 0x78 - 0x80 */

