YavuzSelimKiziltas/STM32F767xx-Drivers/Drivers/Inc/stm32f7xx_pav.h
	__vo uint32_t SSCGR;				/**< Offset = 0x80 */

	__vo uint32_t PLLI2SCFGR;			/**< Offset = 0x84 */

	__vo uint32_t PLLSAICFGR;			/**< Offset = 0x88 */

	__vo uint32_t DCKCFGR1;				/**< Offset = 0x8C */

	__vo uint32_t DCKCFGR2;				/**< Offset = 0x90 */

}RCC_RegTypeDef_t;


/* EXTI Register Typedef (RM pg. 325) */
typedef struct
{
	__vo uint32_t IMR;			/**< Interrupt Mask Register
									 Address Offset = 0x00 */

	__vo uint32_t EMR;			/**< Event Mask Register
									 Offset = 0x04 */

	__vo uint32_t RTSR;			/**< Rising Trigger Selection Register
									 Offset = 0x08 */

	__vo uint32_t FTSR;			/**< Falling Trigger Selection Register
									 Offset = 0x0C */

	__vo uint32_t SWIER;		/**< Software interrupt event register
									 Offset = 0x10 */

	__vo uint32_t PR;			/**< Pending Register (Read/Write)
									 Offset = 0x14 */

}EXTI_RegTypeDef_t;


/* SYSCFG Register Typedef (RM pg. 244) */
typedef struct
{
	__vo uint32_t MEMRMP;		/**< Offset = 0x00 */

	__vo uint32_t PMC;			/**< Offset = 0x04 */

	__vo uint32_t EXTICR[4];	/**< Offset = 0x08 - 0x14 */

	uint32_t RESERVED;			/**< Offset = 0x18 - 0x1C */

	__vo uint32_t CBR;			/**< Offset = 0x1C */

	__vo uint32_t CMPCR;		/**< Offset = 0x20 */

}SYSCFG_RegTypeDef_t;


/* USART Register Typedef (RM pg. 1285) */
typedef struct
{
	__vo uint32_t CR1;				/**< Control Register 1
										 Offset = 0x00 */

	__vo uint32_t CR2;				/**< Control Register 2
										 Offset = 0x04 */

	__vo uint32_t CR3;				/**< Control Register 3
										 Offset = 0x08 */

	__vo uint32_t BRR;				/**< Baud Rate Register
										 Offset = 0x0C */

	__vo uint32_t GTPR;				/**< Guard Time and Prescalar Register
										 Offset = 0x10 */

	__vo uint32_t RTOR;				/**< Receiver Timeout Register
										 Offset = 0x14 */

	__vo uint32_t RQR;				/**< Request Register
										 Offset = 0x18 */

	__vo uint32_t ISR;				/**< Interrupt and Status Register
										 Offset = 0x1C */

	__vo uint32_t ICR;				/**< Interrupt Clear Register
										 Offset = 0x20 */

	__vo uint32_t RDR;				/**< Receive Data Register
										 Offset = 0x24 */

	__vo uint32_t TDR;				/**< Transmit Data Register
										 Offset = 0x28 */

}USART_RegTypeDef_t;

/*********************************************************************************/
//										SYSTICK
/* PM0253 pg. 213 */
typedef struct
{
	__vo uint32_t	CSR;

	__vo uint32_t	RVR;

	__vo uint32_t	CVR;

	__vo uint32_t	CALIB;

}SYSTICK_RegTypeDef_t;

#define SYSTICK_BASEADDR			0xE000E010
#define SYSTICK						((SYSTICK_RegTypeDef_t *) SYSTICK_BASEADDR)

/*********************************************************************************/

/* Structure type to access the Nested Vectored Interrupt Controller (NVIC). */
typedef struct
{
	__vo uint32_t ISER[8];         /*!< Offset: 0x000 (R/W)  Interrupt Set Enable Register */

	uint32_t RESERVED0[24];

	__vo uint32_t ICER[8];         /*!< Offset: 0x080 (R/W)  Interrupt Clear Enable Register */

	uint32_t RSERVED1[24];

	__vo uint32_t ISPR[8];         /*!< Offset: 0x100 (R/W)  Interrupt Set Pending Register */

	uint32_t RESERVED2[24];

	__vo uint32_t ICPR[8U];        /*!< Offset: 0x180 (R/W)  Interrupt Clear Pending Register */

	uint32_t RESERVED3[24];

	__vo uint32_t IABR[8];         /*!< Offset: 0x200 (R/W)  Interrupt Active bit Register */

	uint32_t RESERVED4[56];

	__vo uint8_t  IP[240];         /*!< Offset: 0x300 (R/W)  Interrupt Priority Register (8Bit wide) */

	uint32_t RESERVED5[644];

	__vo  uint32_t STIR;            /*!< Offset: 0xE00 ( /W)  Software Trigger Interrupt Register */

} NVIC_RegTypeDef;

/* This is originally defined in core_m7.h file
   This function is called whenever interrupt function is implemented dont touch. */
static void __NVIC_EnableIRQ(IRQn_Type IRQn)
{
  if ((int32_t)(IRQn) >= 0)
  {
    NVIC->ISER[(((uint32_t)IRQn) >> 5UL)] = (uint32_t)(1UL << (((uint32_t)IRQn) & 0x1FUL));
  }
}

/* Called in PAV_GPIO_Enable_Interrupt() function */
#define NVIC_EnableIRQ              __NVIC_EnableIRQ

/* Define GPIO Ports */
#define GPIOA				((GPIO_RegTypeDef_t *)GPIOA_BASEADDR)
#define GPIOB				((GPIO_RegTypeDef_t *)GPIOB_BASEADDR)
#define GPIOC				((GPIO_RegTypeDef_t *)GPIOC_BASEADDR)
#define GPIOD				((GPIO_RegTypeDef_t *)GPIOD_BASEADDR)
#define GPIOE				((GPIO_RegTypeDef_t *)GPIOE_BASEADDR)
#define GPIOF				((GPIO_RegTypeDef_t *)GPIOF_BASEADDR)
#define GPIOG				((GPIO_RegTypeDef_t *)GPIOG_BASEADDR)
#define GPIOH				((GPIO_RegTypeDef_t *)GPIOH_BASEADDR)

#define RCC					((RCC_RegTypeDef_t *)RCC_BASEADDR)

#define EXTI				((EXTI_RegTypeDef_t *)EXTI_BASEADDR)

#define SYSCFG				((SYSCFG_RegTypeDef_t *)SYSCFG_BASEADDR)

/* Define USART */
#define USART1				((USART_RegTypeDef_t *) USART1_BASEADDR)
#define USART2				((USART_RegTypeDef_t *) USART2_BASEADDR)
#define USART3				((USART_RegTypeDef_t *) USART3_BASEADDR)
#define UART4				((USART_RegTypeDef_t *) UART4_BASEADDR)
#define UART5				((USART_RegTypeDef_t *) UART5_BASEADDR)
#define USART6				((USART_RegTypeDef_t *) USART6_BASEADDR)
#define UART7				((USART_RegTypeDef_t *) UART7_BASEADDR)
#define UART8				((USART_RegTypeDef_t *) UART8_BASEADDR)


/* Clock Enable Macro for SYSCFG peripheral */
#define SYSCFG_CLK_EN() (RCC->APB2ENR |= (1 << 14))

/*********************************************** RCC SECTION ***********************************************/
/*!< PPRE1 configuration */
#define RCC_CFGR_PPRE1_Pos                 (10U)
#define RCC_CFGR_PPRE1_Msk                 (0x7UL << RCC_CFGR_PPRE1_Pos)        /*!< 0x00001C00 */
#define RCC_CFGR_PPRE1                     RCC_CFGR_PPRE1_Msk                  /*!< PRE1[2:0] bits (APB1 prescaler) */

/*!< PPRE2 configuration */
#define RCC_CFGR_PPRE2_Pos                 (13U)
#define RCC_CFGR_PPRE2_Msk                 (0x7UL << RCC_CFGR_PPRE2_Pos)        /*!< 0x0000E000 */
#define RCC_CFGR_PPRE2                     RCC_CFGR_PPRE2_Msk                  /*!< PRE2[2:0] bits (APB2 prescaler) */


/*********************************************** USART SECTION ***********************************************/

/* Clock Enable Macros for USARTx/UARTx (RM pg. 188, 195)*/
#define USART1_CLK_EN()		(RCC->APB2ENR |= (1 << 4))
#define USART2_CLK_EN()		(RCC->APB1ENR |= (1 << 17))
#define USART3_CLK_EN()		(RCC->APB1ENR |= (1 << 18))
#define UART4_CLK_EN()		(RCC->APB1ENR |= (1 << 19))
#define UART5_CLK_EN()		(RCC->APB1ENR |= (1 << 20))
#define USART6_CLK_EN()		(RCC->APB2ENR |= (1 << 5))
#define UART7_CLK_EN()		(RCC->APB1ENR |= (1 << 30))
#define UART8_CLK_EN()		(RCC->APB1ENR |= (1 << 31))

/* Clock Disable Macros for USARTx/UARTx (RM pg. 188, 195)*/
#define USART1_CLK_DIS()	(RCC->APB2ENR &= ~(1 << 4))
#define USART2_CLK_DIS()	(RCC->APB1ENR &= ~(1 << 17))
#define USART3_CLK_DIS()	(RCC->APB1ENR &= ~(1 << 18))
#define UART4_CLK_DIS()		(RCC->APB1ENR &= ~(1 << 19))
#define UART5_CLK_DIS()		(RCC->APB1ENR &= ~(1 << 20))
#define USART6_CLK_DIS()	(RCC->APB2ENR &= ~(1 << 5))
#define UART7_CLK_DIS()		(RCC->APB1ENR &= ~(1 << 30))
#define UART8_CLK_DIS()		(RCC->APB1ENR &= ~(1 << 31))

/* Clock Reset Macros for USARTx/UARTx (RM pg. )*/
#define USART1_CLK_RESET()		(RCC->APB2RSTR |= (1 << 4))
#define USART2_CLK_RESET()		(RCC->APB1RSTR |= (1 << 17))
#define USART3_CLK_RESET()		(RCC->APB1RSTR |= (1 << 18))
#define UART4_CLK_RESET()		(RCC->APB1RSTR |= (1 << 19))
#define UART5_CLK_RESET()		(RCC->APB1RSTR |= (1 << 20))
#define USART6_CLK_RESET()		(RCC->APB2RSTR |= (1 << 5))
#define UART7_CLK_RESET()		(RCC->APB1RSTR |= (1 << 30))
#define UART8_CLK_RESET()		(RCC->APB1RSTR |= (1 << 31))

/*********************************************** GPIO SECTION ***********************************************/

/* Clock Enable Macros for GPIOx Pins (RM pg. 218)*/
#define GPIOA_CLK_EN()		(RCC->AHB1ENR |= (1 << 0))
#define GPIOB_CLK_EN()		(RCC->AHB1ENR |= (1 << 1))
#define GPIOC_CLK_EN()		(RCC->AHB1ENR |= (1 << 2))
#define GPIOD_CLK_EN()		(RCC->AHB1ENR |= (1 << 3))
#define GPIOE_CLK_EN()		(RCC->AHB1ENR |= (1 << 4))
#define GPIOF_CLK_EN()		(RCC->AHB1ENR |= (1 << 5))
#define GPIOG_CLK_EN()		(RCC->AHB1ENR |= (1 << 6))
#define GPIOH_CLK_EN()		(RCC->AHB1ENR |= (1 << 7))

