YavuzSelimKiziltas/STM32F767xx-Drivers/Drivers/Inc/stm32f7xx_pav.h
/* Clock Disable Macros for GPIOx Pins (RM pg. 218)*/
#define GPIOA_CLK_DIS()		(RCC->AHB1ENR &= ~(1 << 0))
#define GPIOB_CLK_DIS()		(RCC->AHB1ENR &= ~(1 << 1))
#define GPIOC_CLK_DIS()		(RCC->AHB1ENR &= ~(1 << 2))
#define GPIOD_CLK_DIS()		(RCC->AHB1ENR &= ~(1 << 3))
#define GPIOE_CLK_DIS()		(RCC->AHB1ENR &= ~(1 << 4))
#define GPIOF_CLK_DIS()		(RCC->AHB1ENR &= ~(1 << 5))
#define GPIOG_CLK_DIS()		(RCC->AHB1ENR &= ~(1 << 6))
#define GPIOH_CLK_DIS()		(RCC->AHB1ENR &= ~(1 << 7))

/* Clock Reset Macros for GPIOx Pins (RM pg. 218)*/
#define GPIOA_CLK_RESET()	(RCC->AHB1RSTR |= (1 << 0))
#define GPIOB_CLK_RESET()	(RCC->AHB1RSTR |= (1 << 1))
#define GPIOC_CLK_RESET()	(RCC->AHB1RSTR |= (1 << 2))
#define GPIOD_CLK_RESET()	(RCC->AHB1RSTR |= (1 << 3))
#define GPIOE_CLK_RESET()	(RCC->AHB1RSTR |= (1 << 4))
#define GPIOF_CLK_RESET()	(RCC->AHB1RSTR |= (1 << 5))
#define GPIOG_CLK_RESET()	(RCC->AHB1RSTR |= (1 << 6))
#define GPIOH_CLK_RESET()	(RCC->AHB1RSTR |= (1 << 7))

/* This macro returns Pin Number to an actual number (GPIO_PIN_3 = 0x0008  ->  3) */
#define GPIO_PIN_TO_NUMBER(x)         ( (x == GPIO_PIN_0)?0:\
										(x == GPIO_PIN_1)?1:\
										(x == GPIO_PIN_2)?2:\
										(x == GPIO_PIN_3)?3:\
								        (x == GPIO_PIN_4)?4:\
								        (x == GPIO_PIN_5)?5:\
								        (x == GPIO_PIN_6)?6:\
										(x == GPIO_PIN_7)?7:\
										(x == GPIO_PIN_8)?8:\
										(x == GPIO_PIN_9)?9:\
										(x == GPIO_PIN_10)?10:\
										(x == GPIO_PIN_11)?11:\
										(x == GPIO_PIN_12)?12:\
										(x == GPIO_PIN_13)?13:\
										(x == GPIO_PIN_14)?14:\
								        (x == GPIO_PIN_15)?15:0)

/* This macro returns Port Number to an actual number (GPIOB -> 1) */
#define GPIO_PORT_TO_NUMBER(x)         ( (x == GPIOA)?0:\
										(x == GPIOB)?1:\
										(x == GPIOC)?2:\
										(x == GPIOD)?3:\
								        (x == GPIOE)?4:\
								        (x == GPIOF)?5:\
								        (x == GPIOG)?6:\
										(x == GPIOH)?7:0)

//#include "stm32f7xx_pav_gpio.h"
//#include "stm32f7xx_pav_usart.h"

#endif /* DRIVERS_INC_STM32F7XX_PAV_H_ */
